Revit 2024 API
YJustification Enumeration
 The justification of the framing element in Y.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum YJustification
Visual Basic
Public Enumeration YJustification
Visual C++
public enum class YJustification
Members
Member name | Description
Left |  Justification to the left of the element.
Center |  Justification to the geometrical center of the element.
Origin |  Justification to the origin of the element.
Right |  Justification to the right of the element.
See Also
Autodesk.Revit.DB.Structure Namespace